# Scale

## Description
Procedure Scale rescales selected objects. Scaling occurs about the center of the selected object(s).&lt;BR&gt;
&lt;BR&gt;

```pascal
PROCEDURE Scale(
				scaleXR : REAL;
				scaleYR : REAL);
```

```python

def vs.Scale(scaleXR, scaleYR):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|scaleXR|REAL|X scale factor.|
|scaleYR|REAL|Y scale factor.|

## Examples
```pascal
Scale(2,3);

```

## Version
Availability: from MiniCAD
## Category
* General Edit